<template>
  <view class="page-container">
    <scroll-view class="scroll-Y" :scroll-y="true">
      <view class="content">
        <h2>
          用户隐私保护协议：
          <br />
          尊敬的用户：
          <br />
          感谢您选择我们的商城服务！我们非常重视用户的隐私和个人信息安全。为了更好地保护您的个人信息，我们制定了本《用户隐私保护协议》(以下简称“本协议”，请您在使用我们的服务前，仔细阅读并理解本协议的全部内容。
          <br />
          一、信息收集
          <br />
          1.1为提供更好的服务，我们可能需要收集以下信息：
          <br />
          ·当您注册账户时，我们会收集您的用户名、密码、手机号码以及其他您自愿提供的信息。
          <br />
          · 当您使用设备操作的功能时，我们会记录您的萃取记录、配方信息等。
          <br />
          · 当您参与促销活动或问卷调查时，我们会收集您提供的相关信息。
          <br />
          · 当您使用我们的客户服务时，我们会记录您的沟通内容及反馈信息。
          <br />
          1.2 收集信息的方式：
          <br />
          在您明确同意的情况下，我们可能会通过技术手段自动收集某些信息，例如IP地址、设备信息、操作系统类型、浏览器类型等。
          <br />
          二、信息使用
          <br />
          2.1 我们仅在以下情况使用您的信息:
          <br />
          · 提供您请求的产品或服务。
          <br />
          · 改进我们的服务，以更好地满足您的需求。
          <br />
          · 向您发送重要通知，如服务变更信息。
          <br />
          · 发送促销信息，但前提是您已经同意接收此类信息。
          <br />
          三、信息存储
          <br />
          3.1 存储地点：您的个人信息将主要存储在中国境内的服务器上。
          <br />
          3.2
          存储期限：我们将根据法律法规的要求以及为您提供服务的实际需要，会理确定信息存储时间。当不再重要这些信息时，我们将采取适当措施予以删除或匿名化处理
          <br />
          四、信息共享与传输
          <br />
          4.1 我们不会将您的个人信息出售给任何第三方。
          <br />
          4.2 在以下情况下，我们可能会共享您的个人信息：
          <br />
          · 获得您的明确同意后。
          <br />
          · 根据法律法规的要求，或响应政府部门的合法要求。
          <br />
          · 为维护社会公共利益，或保护我们的合法权益。
          <br />
          五、信息保护
          <br />
          5.1 我们将采取适当的技术和管理措施来保护您的个人信息免受未经授权的访问、使用或泄露。
          <br />
          5.2
          如果发生个人信息泄露事件，我们将及时采取补救措施，并按照法律法规的要求向您通报相关情况。
          <br />
          六、您的权利
          <br />
          6.1 您有权访问、更正、删除您的个人信息。
          <br />
          6.2 您有权改变或撤销对个人信息处理的授权。
          <br />
          6.3 您可以通过我们的客户服务渠道联系我们，行使上述权利
          <br />
          七、未成年人保护
          <br />
          7.1 对于未成年人个人信息的保护，我们严格遵循相关法律法规的要求。
          <br />
          7.2
          如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，我们将采取措施尽快删除该信息。
          <br />
          八、协议变更：
          <br />
          8.1 我们保留在必要时更新或修改本协议的权利。
          <br />
          8.2 一旦本协议有任何变动，我们会在我们的官方网站或应用内发布更新版本。
          <br />
          九、联系我们：如果您对本隐私协议有任何疑问或建议，请通过以下方式联系我们:
          <br />
          · 客服邮箱:4963384@qq.com
          <br />
          · 客服电话:18026560821
        </h2>
        <p></p>
      </view>
    </scroll-view>
  </view>
</template>

<style lang="scss" scoped>
.page-container {
  background-color: white;
  height: 100vh;
  .scroll-Y {
    height: 100%;
    font-size: 28rpx;
    line-height: 48rpx;
  }
  .content {
    padding: 24rpx 24rpx 48rpx 24rpx;
    text-align: justify; /* 可能会导致中文文本不齐 */
    letter-spacing: normal; /* 重置字母间距 */
  }
}
</style>
