<template>
  <view class="page-container">
    <scroll-view class="scroll-Y" :scroll-y="true">
      <view class="content">
        <h2>
          用户服务协议
          欢迎使用我们的小程序服务！请您在使用我们的微信小程序服务之前，仔细阅读并理解本《用户服务协议》(以下简称“本协议”)。一旦您开始使用我们的服务，即表示您已充分读、理解并接受本协议的全部内容，并同意遵循本协议的所有条款。
          <br />
          1.协议适用范围：本协议适用于您通过我们的微信小程序、应用程序及其他提供的服务。您在使用我们提供的各项服务时，均应遵守本协议的规定。
          <br />
          2.用户资格使用本小程序服务的用户必须能够独立承担法律责任。未成年人应在法定监护人的指导下使用本小程序服务。
          <br />
          3.注册与账号安全：您需要注册账号以使用部分服务。在注册过程中，您需要提供直实准确的信息，并确保这些信息的有效性。您应对自己的账号密码采取妥善保护措施，并对账号下的一切活动承担责任。
          <br />
          4.用户行为规范：您不得利用本小程序从事任何违反法律法规的行为。您不得发布任何侵犯他人合法权益的信息，包括但不限于侵犯他人隐私权、名誉权等。您不得传播任何含有病毒或其他有害成分的内容。
          <br />
          5.服务费用：本小程序的部分服务可能会收取一定的费用，具体收费标准请参照小程序页面说明。小程序有权根据实际情况调整收费标准，并提前通知用户。
          <br />
          6.交易与支付：用户在本小程序内的所有交易行为均应遵守相关的法律法规。用户需确保支付方式的安全性和合法性，对于因支付方式产生的任何纠纷，本小程序不承担责任。
          <br />
          7.版权声明：本小程序中的所有内容，包括但不限于文字、图片、音频、视频等，其版权归本小程序所有或由本小程序获得合法授权。未经本小程序书面许可，任何个人和单位不得擅自复制、转载、链接或以其他方式使用这些内容。
          <br />
          8.信息保护：本小程序重视用户的个人信息保护，我们将按照相关法律法规要求处理您的个人信息。具体信息保护措施请参见我们的《隐私政策》。
          <br />
          9.免责声明：本小程序不对因不可抗力因素导致的服务中断或其他损失承担责任。本小程序不对第三方提供的产品或服务质量负责。
          <br />
          10.协议变更：本小程序保留随时修改本协议的权利，并会在修改后公布最新版本。修改后的协议一经公布即生效，如果您继续使用本小程序的服务，则视为接受修改后的协议。
          <br />
          11.联系我们：如果您有任何疑问或建议，请通过我们的客服联系方式与我们取得联系。
          <br />
        </h2>
        <p></p>
      </view>
    </scroll-view>
  </view>
</template>

<style lang="scss" scoped>
.page-container {
  background-color: white;
  height: 100vh;
  overflow: auto;
  .scroll-Y {
    height: 100%;
    font-size: 28rpx;
    line-height: 48rpx;
  }
  .content {
    padding: 24rpx 24rpx 48rpx 24rpx;
    text-align: justify; /* 可能会导致中文文本不齐 */
    letter-spacing: normal; /* 重置字母间距 */
  }
}
</style>
